myfitpal/app/controllers/api/v1/meals_controller.rb

SELECT "user_meals".* FROM "user_meals"
---
    def index #/api/v1/users
        @meals = Meal.all

INSERT INTO "meals" ("name", "created_at", "updated_at", "imgurl") VALUES (?, ?, ?, ?)  [["name", ""], ["created_at", "2020-04-16 18:54:47.511521"], ["updated_at", "2020-04-16 18:54:47.511521"], ["imgurl", ""]]
---
    def create
        @meal = Meal.create(meal_params)