myfitpal/app/controllers/api/v1/user_workouts_controller.rb

SELECT "user_workouts".* FROM "user_workouts"
SELECT "workouts".* FROM "workouts"
---
    def index #/api/v1/users
        @user_workouts = UserWorkout.all

INSERT INTO "user_workouts" ("user_id", "workout_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["workout_id", 13], ["created_at", "2020-04-13 00:18:08.004803"], ["updated_at", "2020-04-13 00:18:08.004803"]]
---
    def create
        @user_workout = UserWorkout.create(user_workout_params)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "user_workouts".* FROM "user_workouts" WHERE "user_workouts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "user_workouts" WHERE "user_workouts"."id" = ?  [["id", 4]]
---
    def destroy
        @user_workout = UserWorkout.find(params[:id])
        @user_workout.destroy