myfitpal/app/controllers/api/v1/user_meals_controller.rb

SELECT "user_meals".* FROM "user_meals"
---
    def index #/api/v1/users
        @user_meals = UserMeal.all

INSERT INTO "user_meals" ("user_id", "meal_id", "created_at", "updated_at", "typeofmeal") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["meal_id", 1], ["created_at", "2020-04-12 06:31:15.766249"], ["updated_at", "2020-04-12 06:31:15.766249"], ["typeofmeal", "lunch"]]
---
    def create
        @user_meal = UserMeal.create(user_meal_params)

SELECT "user_meals".* FROM "user_meals" WHERE "user_meals"."id" = ? LIMIT ?  [["id", 94], ["LIMIT", 1]]
DELETE FROM "user_meals" WHERE "user_meals"."id" = ?  [["id", 94]]
---
    def destroy
        @user_meal = UserMeal.find(params[:id])
        @user_meal.destroy