myfitpal/app/controllers/api/v1/workouts_controller.rb

    def index #/api/v1/users
        @workouts = Workout.all
---
SELECT "user_workouts".* FROM "user_workouts"
SELECT "workouts".* FROM "workouts"

    def create
        @workout = Workout.create(workout_params)
---
INSERT INTO "workouts" ("name", "created_at", "updated_at", "imgurl") VALUES (?, ?, ?, ?)  [["name", ""], ["created_at", "2020-04-16 03:35:28.778018"], ["updated_at", "2020-04-16 03:35:28.778018"], ["imgurl", ""]]